bench-bnb/app/models/api/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "josh3"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Z9YrmJ31bz7bINoix9Iufg"], ["updated_at", "2018-12-07 19:58:02.019335"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!