bench-bnb/app/controllers/api/benches_controller.rb

INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Bench 3"], ["lat", 37.7988098], ["lng", -122.4014172], ["created_at", "2018-12-10 23:09:19.530845"], ["updated_at", "2018-12-10 23:09:19.530845"]]
---
  def create
    @bench = Bench.new(bench_params)

    if @bench.save

SELECT "benches".* FROM "benches"
---
  def index
    @benches = Bench.all